# If1. Дано целое число. Если оно является положительным, то прибавить к
# нему 1; в противном случае не изменять его. Вывести полученное число.
'''a = int(input("a = "))
if a > 0:
    s = a + 1
    print(s)
else:
    print(a)'''


# If2. Дано целое число. Если оно является положительным, то прибавить к
# нему 1; в противном случае вычесть из него 2. Вывести полученное число.
'''s = int(input("s = "))
if s > 0:
    f = s + 1
    print(f)
else:
    g = s - 2
    print(g)'''

# If3. Дано целое число. Если оно является положительным, то прибавить к
# нему 1; если отрицательным, то вычесть из него 2; если нулевым, то
# заменить его на 10. Вывести полученное число

'''a = int(input("a = "))
d = 10
if a > 0:
    k = a + 1
    print(k)
elif a < 0:
    l = a - 2
    print(l)
elif a == 0:
    a = d
    print(a)'''

# If4◦
# . Даны три целых числа. Найти количество положительных чисел в исходном наборе
'''a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))
print((a > 0) + (b > 0) + (c > 0))'''

# If5. Даны три целых числа. Найти количество положительных и количество
# отрицательных чисел в исходном наборе.

'''a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))
print((a > 0) + (b > 0) + (c > 0))

print((a < 0) + (b < 0) + (c < 0))'''

# If6◦
# . Даны два числа. Вывести большее из них.
'''a = int(input("a = "))
b = int(input("b = "))
if a > b:
    print(a)
elif b > a:
    print(b)
else:
    print("Hardush barobar")'''

# If7. Даны два числа. Вывести порядковый номер меньшего из них.
a = int(input("a = "))
b = int(input("b = "))
if a > b:
    print(a)
elif b > a:
    print(b)
































